#+TITLE: json => triggers => views in PostgreSQL
#+TODO: TODO | TADA


* operations
#+BEGIN_SRC  shell
cat ../swagger.json \
  | jq -c '.paths | to_entries | .[].value | to_entries | .[].value | {operationId: .operationId, parameters: .parameters, responses: .responses}'\
  | jq .
 # | head -10 | tail -1
#| {operationId:.operationId}' \
# .[].value | to_entries[][]' \
#  | head -200 | tail -1 | jq .
# | {operationId: .operationId}' \
# {"operationId": value.operationId, "parameter": value.parameters, "responses": value.responses}' #| head -200 | tail -1 | jq .
# |.[].value | to_entries[] | {"operationId": .operationId, "parameter": .parameters, "responses": .responses}'  | head -200 | tail -1 | jq .
#+END_SRC

#+RESULTS:
#+begin_EXAMPLE
{
  "operationId": "getCoreAPIVersions",
  "parameters": null,
  "responses": {
    "200": {
      "description": "OK",
      "schema": {
        "$ref": "#/definitions/io.k8s.apimachinery.pkg.apis.meta.v1.APIVersions"
      }
    },
    "401": {
      "description": "Unauthorized"
    }
  }
}
{
  "operationId": "getCoreV1APIResources",
  "parameters": null,
  "responses": {
    "200": {
      "description": "OK",
      "schema": {
        "$ref": "#/definitions/io.k8s.apimachinery.pkg.apis.meta.v1.APIResourceList"
      }
    },
    "401": {
      "description": "Unauthorized"
    }
  }
}
{
  "operationId": "listCoreV1ComponentStatus",
  "parameters": null,
  "responses": {
    "200": {
      "description": "OK",
      "schema": {
        "$ref": "#/definitions/io.k8s.api.core.v1.ComponentStatusList"
      }
    },
    "401": {
      "description": "Unauthorized"
    }
  }
}
#+end_EXAMPLE


* raw_json Loader

https://www.postgresql.org/docs/current/sql-copy.html

#+BEGIN_SRC  shell
  cat ../swagger.json | jq -c '.definitions | to_entries | map(.value.definition = .key) | map(.value.version="local") | .[].value'  | wc -l
#+END_SRC

#+RESULTS:
#+begin_EXAMPLE
630
#+end_EXAMPLE

NEXT!
- pipe swagger's definitions into sql table
- ensure that when we go to 'hasura.sharing.io' you can see this table.
- construct some views, through sql and graphql.

#+BEGIN_SRC tmate
  cat ../swagger.json | jq -c . \
  | psql -c "COPY raw_swaggers (data) FROM STDIN (DELIMITER e'\x02', FORMAT 'csv', QUOTE e'\x01');"
#+END_SRC


#+BEGIN_SRC tmate
  cat ../swagger.json \
  | jq -c '.definitions | to_entries | map(.value.definition = .key) | map(.value.version="local") | .[].value' \
  | psql -c "COPY raw_api_definitions (data) FROM STDIN (DELIMITER e'\x02', FORMAT 'csv', QUOTE e'\x01');"
#+END_SRC

This is one line of json per line, which will be the 'jsonb' type for the data column when we import.

#+BEGIN_SRC shell
  cat swagger.json | jq '.definitions' | 
  | sort -R | grep -vi alpha\\\|beta | grep core | head -40 
cat data.json | psql -h localhost -p 5432 feeds -c \
  "COPY raw_api_definitions (definition_id,data) FROM STDIN with delimite;"
#  "COPY raw_api_definitions (data) FROM STDIN WITH version='master-123';"
#+END_SRC

